jin04151/SmartHomeSafety_stm32-uC-OS3/app.c
/*
*********************************************************************************************************
* RTOS Smart Home Safety System - app.c
* Based on HW #6 starter skeleton.
*
* Core flow:
*   EXTI ISR(gas/flame/PIR/button) -> semaphore / event flag -> task -> queue -> output/log
*
* NOTE:
*   1) Check pin mapping for your own board/wiring.
*   2) AppUsartTryGetLine() is intentionally compatible with HW5 style USART code.
*      Replace USARTx if your skeleton uses a different USART.
*********************************************************************************************************
*/

#include  <includes.h>
#include "stm32f4xx_tim.h"
#include  "stm32f4xx.h"
#include  "stm32f4xx_rcc.h"
#include  "stm32f4xx_gpio.h"
#include  "stm32f4xx_exti.h"
#include  "stm32f4xx_syscfg.h"
#include  "misc.h"

/* ---------------- Priority ---------------- */
#define APP_CFG_EMERGENCY_TASK_PRIO      3u
#define APP_CFG_SECURITY_TASK_PRIO       4u
#define APP_CFG_INPUT_TASK_PRIO          5u
#define APP_CFG_STATE_TASK_PRIO          6u
#define APP_CFG_USART_TASK_PRIO          7u
#define APP_CFG_OUTPUT_TASK_PRIO         8u
#define APP_CFG_MONITOR_TASK_PRIO        9u

#define APP_CFG_TASK_STK_SIZE            APP_CFG_TASK_START_STK_SIZE
#define APP_EVENT_Q_SIZE                 16u
#define APP_CMD_LINE_LEN                 40u

/* ---------------- EXTI input pin example ----------------
 * Gas   DO -> PA0, EXTI0
 * Flame DO -> PA1, EXTI1
 * PIR   DO -> PA2, EXTI2
 * Button   -> PC13, EXTI13
 */
#define GAS_GPIO_PORT                    GPIOA
#define GAS_GPIO_PIN                     GPIO_Pin_0
#define GAS_EXTI_LINE                    EXTI_Line0
#define GAS_EXTI_PORT_SRC                EXTI_PortSourceGPIOA
#define GAS_EXTI_PIN_SRC                 EXTI_PinSource0

#define FLAME_GPIO_PORT                  GPIOF
#define FLAME_GPIO_PIN                   GPIO_Pin_15
#define FLAME_EXTI_LINE                  EXTI_Line15
#define FLAME_EXTI_PORT_SRC              EXTI_PortSourceGPIOF
#define FLAME_EXTI_PIN_SRC               EXTI_PinSource15

#define PIR_GPIO_PORT                    GPIOF
#define PIR_GPIO_PIN                     GPIO_Pin_14
#define PIR_EXTI_LINE                    EXTI_Line14
#define PIR_EXTI_PORT_SRC                EXTI_PortSourceGPIOF
#define PIR_EXTI_PIN_SRC                 EXTI_PinSource14

#define BTN_GPIO_PORT                    GPIOC
#define BTN_GPIO_PIN                     GPIO_Pin_13
#define BTN_EXTI_LINE                    EXTI_Line13
#define BTN_EXTI_PORT_SRC                EXTI_PortSourceGPIOC
#define BTN_EXTI_PIN_SRC                 EXTI_PinSource13

/* ---------------- Output pin example ----------------
 * LED1 alarm    -> PB8  (LED1 module RED)
 * LED2 power    -> PB9  (LED2 module RED)
 * LED3 status   -> PB10 (LED2 module GREEN)
 * Buzzer        -> PD12
 * Servo         -> placeholder function. If PWM is ready, replace AppServoSetAngle().
 */
#define LED_GPIO_PORT     GPIOB
#define LED_ALARM_PIN     GPIO_Pin_8
#define LED_POWER_PIN     GPIO_Pin_9
#define LED_STATUS_PIN    GPIO_Pin_10

#define BUZZER_GPIO_PORT                 GPIOD
#define BUZZER_GPIO_PIN                  GPIO_Pin_12

#define APP_BUTTON_DEBOUNCE_MS           50u

#define APP_FLAG_GAS                     0x01u
#define APP_FLAG_FLAME                   0x02u

/* ---------------- Types ---------------- */
typedef enum {
    APP_MODE_HOME = 0,
    APP_MODE_OUT,
    APP_MODE_EMERGENCY
} APP_MODE;

typedef enum {
    APP_EVENT_NONE = 0,
    APP_EVENT_REQ_HOME,
    APP_EVENT_REQ_OUT,
    APP_EVENT_REQ_CLEAR,
    APP_EVENT_GAS,
    APP_EVENT_FLAME,
    APP_EVENT_INTRUSION,
    APP_EVENT_CMD_STATUS,
    APP_EVENT_CMD_HELP
} APP_EVENT_TYPE;

typedef struct {
    APP_EVENT_TYPE Type;
    CPU_INT32U     Value;
} APP_EVENT;

/* ---------------- Prototypes ---------------- */
static void AppTaskStart     (void *p_arg);
static void AppTaskEmergency (void *p_arg);
static void AppTaskSecurity  (void *p_arg);
static void AppTaskInput     (void *p_arg);
static void AppTaskState     (void *p_arg);
static void AppTaskUsart     (void *p_arg);
static void AppTaskOutput    (void *p_arg);
static void AppTaskMonitor   (void *p_arg);

static void AppObjCreate     (void);
static void AppTaskCreate    (void);
static void AppGpioInit      (void);
static void AppExtiInit      (void);

static void AppExti0ISR      (void);
static void AppExti1ISR      (void);
static void AppExti2ISR      (void);
static void AppExti15_10ISR  (void);

static void AppEventPost     (APP_EVENT_TYPE type, CPU_INT32U value);
static void AppCmdParse      (CPU_CHAR *line);
static void AppPrintHelp     (void);
static void AppPrintStatus   (void);
static void AppTrace         (const CPU_CHAR *msg);
static CPU_BOOLEAN AppUsartTryGetLine(CPU_CHAR *buf, CPU_INT16U buf_len);
static CPU_BOOLEAN AppStrEq  (const CPU_CHAR *a, const CPU_CHAR *b);

static void AppApplyOutputs  (void);
static void AppAlarmOn       (void);
static void AppAlarmOff      (void);
static void AppPowerCut      (void);
static void AppPowerOn       (void);
static void AppServoSetAngle (CPU_INT08U degree);
static CPU_BOOLEAN AppDangerStillActive(void);

static void Setup_Usart3(void);
static void Setup_Servo_PWM(void);


/* ---------------- Kernel objects / globals ---------------- */
static OS_TCB  AppTaskStartTCB;
static CPU_STK AppTaskStartStk[APP_CFG_TASK_START_STK_SIZE];

static OS_TCB  AppTaskEmergencyTCB;
static OS_TCB  AppTaskSecurityTCB;
static OS_TCB  AppTaskInputTCB;
static OS_TCB  AppTaskStateTCB;
static OS_TCB  AppTaskUsartTCB;
static OS_TCB  AppTaskOutputTCB;
static OS_TCB  AppTaskMonitorTCB;

static CPU_STK AppTaskEmergencyStk[APP_CFG_TASK_STK_SIZE];
static CPU_STK AppTaskSecurityStk [APP_CFG_TASK_STK_SIZE];
static CPU_STK AppTaskInputStk    [APP_CFG_TASK_STK_SIZE];
static CPU_STK AppTaskStateStk    [APP_CFG_TASK_STK_SIZE];
static CPU_STK AppTaskUsartStk    [APP_CFG_TASK_STK_SIZE];
static CPU_STK AppTaskOutputStk   [APP_CFG_TASK_STK_SIZE];
static CPU_STK AppTaskMonitorStk  [APP_CFG_TASK_STK_SIZE];

static OS_FLAG_GRP AppEmergencyFlags;
static OS_SEM      AppPirSem;
static OS_SEM      AppButtonSem;
static OS_Q        AppEventQ;
static OS_MUTEX    AppModeMutex;

