jin04151/SmartHomeSafety_stm32-uC-OS3/app.c
static APP_EVENT   AppEventPool[APP_EVENT_Q_SIZE];
static CPU_INT08U  AppEventWrIx;

static APP_MODE    AppMode;
static APP_MODE    AppPrevMode;

static CPU_BOOLEAN AppEmergencyActive;
static CPU_BOOLEAN AppPirDetected;

static CPU_INT32U  AppGasCount;
static CPU_INT32U  AppFlameCount;
static CPU_INT32U  AppPirCount;
static CPU_INT32U  AppButtonCount;
static CPU_INT32U  AppCommandCount;

/* ---------------- main ---------------- */
int main(void)
{
    OS_ERR err;

    RCC_DeInit();
    AppGpioInit();

    BSP_IntDisAll();
    CPU_Init();
    Mem_Init();
    Math_Init();
    OSInit(&err);

    OSTaskCreate(&AppTaskStartTCB,
                 "App Task Start",
                 AppTaskStart,
                 (void *)0u,
                 APP_CFG_TASK_START_PRIO,
                 &AppTaskStartStk[0u],
                 APP_CFG_TASK_START_STK_SIZE / 10u,
                 APP_CFG_TASK_START_STK_SIZE,
                 0u,
                 0u,
                 (void *)0u,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);

    OSStart(&err);

    return 0u;
}

/* ---------------- Start task ---------------- */
static void AppTaskStart(void *p_arg)
{
    OS_ERR err;
    (void)p_arg;
    BSP_Init();
    BSP_Tick_Init();
    AppExtiInit();
    Setup_Usart3();
    Setup_Servo_PWM();
	#if OS_CFG_STAT_TASK_EN > 0u
    OSStatTaskCPUUsageInit(&err);
	#endif
	#ifdef CPU_CFG_INT_DIS_MEAS_EN
    CPU_IntDisMeasMaxCurReset();
	#endif
    AppObjCreate();
    AppTaskCreate();
    AppTrace("\r\n[BOOT] Smart Home Safety System Start\r\n");
    AppPrintHelp();
    OSTaskDel((OS_TCB *)0, &err);
}

/* ---------------- Emergency: gas/flame ---------------- */
static void AppTaskEmergency(void *p_arg)
{
    OS_ERR   err;
    CPU_TS   ts;
    OS_FLAGS flags;

    (void)p_arg;

    while (DEF_TRUE) {
        flags = OSFlagPend(&AppEmergencyFlags,
                           APP_FLAG_GAS | APP_FLAG_FLAME,
                           0u,
                           OS_OPT_PEND_FLAG_SET_ANY |
                           OS_OPT_PEND_FLAG_CONSUME |
                           OS_OPT_PEND_BLOCKING,
                           &ts,
                           &err);

        if ((flags & APP_FLAG_GAS) != 0u) {
            AppGasCount++;
            AppTrace("[ALERT][EMERGENCY] GAS detected\r\n");
            AppEventPost(APP_EVENT_GAS, 0u);
        }

        if ((flags & APP_FLAG_FLAME) != 0u) {
            AppFlameCount++;
            AppTrace("[ALERT][EMERGENCY] FLAME detected\r\n");
            AppEventPost(APP_EVENT_FLAME, 0u);
        }
    }
}

/* ---------------- Security: PIR only active in OUT mode ---------------- */
static void AppTaskSecurity(void *p_arg)
{
    OS_ERR   err;
    CPU_TS   ts;
    APP_MODE mode_snapshot;

    (void)p_arg;

    while (DEF_TRUE) {
        OSSemPend(&AppPirSem,
                  0u,
                  OS_OPT_PEND_BLOCKING,
                  &ts,
                  &err);

        AppPirCount++;
        AppPirDetected = DEF_TRUE;

        OSMutexPend(&AppModeMutex,
                    0u,
                    OS_OPT_PEND_BLOCKING,
                    &ts,
                    &err);

        mode_snapshot = AppMode;

        OSMutexPost(&AppModeMutex,
                    OS_OPT_POST_NONE,
                    &err);

        if (mode_snapshot == APP_MODE_OUT) {
            AppTrace("[ALERT][SECURITY] Intrusion detected in OUT mode\r\n");
            AppEventPost(APP_EVENT_INTRUSION, 0u);
        } else {
            AppTrace("[INFO][SECURITY] PIR ignored in HOME/EMERGENCY mode\r\n");
        }
    }
}

/* ---------------- Button input ---------------- */
static void AppTaskInput(void *p_arg)
{
    OS_ERR   err;
    CPU_TS   ts;
    APP_MODE mode_snapshot;

    (void)p_arg;

    while (DEF_TRUE) {
        OSSemPend(&AppButtonSem,
                  0u,
                  OS_OPT_PEND_BLOCKING,
                  &ts,
                  &err);

        OSTimeDlyHMSM(0u,
                      0u,
                      0u,
                      APP_BUTTON_DEBOUNCE_MS,
                      OS_OPT_TIME_HMSM_STRICT,
                      &err);

        AppButtonCount++;

        OSMutexPend(&AppModeMutex,
                    0u,
                    OS_OPT_PEND_BLOCKING,
                    &ts,
                    &err);

        mode_snapshot = AppMode;

        OSMutexPost(&AppModeMutex,
                    OS_OPT_POST_NONE,
                    &err);

        if (mode_snapshot == APP_MODE_HOME) {
            AppTrace("[INFO][INPUT] Button -> OUT request\r\n");
            AppEventPost(APP_EVENT_REQ_OUT, 0u);
        } else if (mode_snapshot == APP_MODE_OUT) {
            AppTrace("[INFO][INPUT] Button -> HOME request\r\n");
            AppEventPost(APP_EVENT_REQ_HOME, 0u);
        } else {
            AppTrace("[WARN][INPUT] Button -> CLEAR emergency request\r\n");
            AppEventPost(APP_EVENT_REQ_CLEAR, 0u);
        }
    }
}

/* ---------------- State controller ---------------- */
static void AppTaskState(void *p_arg)
{
    OS_ERR      err;
    OS_MSG_SIZE msg_size;
    CPU_TS      ts;
    APP_EVENT  *p_event;

    (void)p_arg;

    while (DEF_TRUE) {
        p_event = (APP_EVENT *)OSQPend(&AppEventQ,
                                       0u,
                                       OS_OPT_PEND_BLOCKING,
                                       &msg_size,
                                       &ts,
                                       &err);

        if (p_event == (APP_EVENT *)0) {
            continue;
        }

        OSMutexPend(&AppModeMutex,
                    0u,
                    OS_OPT_PEND_BLOCKING,
                    &ts,
                    &err);

        switch (p_event->Type) {
        case APP_EVENT_REQ_OUT:
            if (AppMode != APP_MODE_EMERGENCY) {
                AppPrevMode = AppMode;
                AppMode = APP_MODE_OUT;
                AppTrace("[INFO][STATE] Mode changed: OUT\r\n");
            }
            break;

        case APP_EVENT_REQ_HOME:
            if (AppMode != APP_MODE_EMERGENCY) {
                AppPrevMode = AppMode;
                AppMode = APP_MODE_HOME;
                AppTrace("[INFO][STATE] Mode changed: HOME\r\n");
            }
            break;

        case APP_EVENT_GAS:
        case APP_EVENT_FLAME:
        case APP_EVENT_INTRUSION:
            if (AppMode != APP_MODE_EMERGENCY) {
                AppPrevMode = AppMode;
            }

            AppMode = APP_MODE_EMERGENCY;
            AppEmergencyActive = DEF_TRUE;

            AppTrace("[ALERT][STATE] Mode changed: EMERGENCY\r\n");
            break;

        case APP_EVENT_REQ_CLEAR:
            if (AppMode == APP_MODE_EMERGENCY) {
                if (AppDangerStillActive() == DEF_FALSE) {
                    AppMode = AppPrevMode;
                    AppEmergencyActive = DEF_FALSE;
                    AppTrace("[INFO][STATE] Emergency cleared\r\n");
                } else {
                    AppTrace("[WARN][STATE] Clear rejected: danger still active\r\n");
                }
            }
            break;

