jin04151/SmartHomeSafety_stm32-uC-OS3/app.c
        case APP_EVENT_CMD_STATUS:
            AppPrintStatus();
            break;

        case APP_EVENT_CMD_HELP:
            AppPrintHelp();
            break;

        default:
            break;
        }

        OSMutexPost(&AppModeMutex,
                    OS_OPT_POST_NONE,
                    &err);

        AppApplyOutputs();
    }
}

/* ---------------- USART command task ---------------- */
static void AppTaskUsart(void *p_arg)
{
    OS_ERR   err;
    CPU_CHAR line[APP_CMD_LINE_LEN];

    (void)p_arg;

    while (DEF_TRUE) {
        if (AppUsartTryGetLine(line, sizeof(line)) == DEF_TRUE) {
            AppCommandCount++;
            AppCmdParse(line);
        }

        OSTimeDlyHMSM(0u,
                      0u,
                      0u,
                      20u,
                      OS_OPT_TIME_HMSM_STRICT,
                      &err);
    }
}

/* ---------------- Output heartbeat / emergency blink ---------------- */
static void AppTaskOutput(void *p_arg)
{
    OS_ERR      err;
    CPU_BOOLEAN blink = DEF_FALSE;

    (void)p_arg;

    while (DEF_TRUE) {
        if (AppMode == APP_MODE_EMERGENCY) {
            blink = (blink == DEF_TRUE) ? DEF_FALSE : DEF_TRUE;

            if (blink == DEF_TRUE) {
                GPIO_SetBits(LED_GPIO_PORT, LED_ALARM_PIN);
                GPIO_SetBits(BUZZER_GPIO_PORT, BUZZER_GPIO_PIN);
            } else {
                GPIO_ResetBits(LED_GPIO_PORT, LED_ALARM_PIN);
                GPIO_ResetBits(BUZZER_GPIO_PORT, BUZZER_GPIO_PIN);
            }
        } else {
            AppApplyOutputs();
        }

        OSTimeDlyHMSM(0u,
                      0u,
                      0u,
                      200u,
                      OS_OPT_TIME_HMSM_STRICT,
                      &err);
    }
}

/* ---------------- Monitor task ---------------- */
static void AppTaskMonitor(void *p_arg)
{
    OS_ERR err;
    BitAction flame_raw;

    (void)p_arg;

    while (DEF_TRUE) {

        OSTimeDlyHMSM(0u,
                      0u,
                      0u,
                      100u,
                      OS_OPT_TIME_HMSM_STRICT,
                      &err);
    }
}

/* ---------------- Kernel objects ---------------- */
static void AppObjCreate(void)
{
    OS_ERR err;

    OSFlagCreate(&AppEmergencyFlags,
                 "Emergency Flags",
                 0u,
                 &err);

    OSSemCreate(&AppPirSem,
                "PIR Semaphore",
                0u,
                &err);

    OSSemCreate(&AppButtonSem,
                "Button Semaphore",
                0u,
                &err);

    OSQCreate(&AppEventQ,
              "Event Queue",
              APP_EVENT_Q_SIZE,
              &err);

    OSMutexCreate(&AppModeMutex,
                  "Mode Mutex",
                  &err);

    AppMode = APP_MODE_HOME;
    AppPrevMode = APP_MODE_HOME;
    AppEmergencyActive = DEF_FALSE;
    AppPirDetected = DEF_FALSE;

    AppEventWrIx = 0u;

    AppGasCount = 0u;
    AppFlameCount = 0u;
    AppPirCount = 0u;
    AppButtonCount = 0u;
    AppCommandCount = 0u;
}

/* ---------------- Task create ---------------- */
static void AppTaskCreate(void)
{
    OS_ERR err;

    OSTaskCreate(&AppTaskEmergencyTCB,
                 "Emergency Task",
                 AppTaskEmergency,
                 0,
                 APP_CFG_EMERGENCY_TASK_PRIO,
                 &AppTaskEmergencyStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);

    OSTaskCreate(&AppTaskSecurityTCB,
                 "Security Task",
                 AppTaskSecurity,
                 0,
                 APP_CFG_SECURITY_TASK_PRIO,
                 &AppTaskSecurityStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);

    OSTaskCreate(&AppTaskInputTCB,
                 "Input Task",
                 AppTaskInput,
                 0,
                 APP_CFG_INPUT_TASK_PRIO,
                 &AppTaskInputStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);

    OSTaskCreate(&AppTaskStateTCB,
                 "State Task",
                 AppTaskState,
                 0,
                 APP_CFG_STATE_TASK_PRIO,
                 &AppTaskStateStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);

    OSTaskCreate(&AppTaskUsartTCB,
                 "USART Task",
                 AppTaskUsart,
                 0,
                 APP_CFG_USART_TASK_PRIO,
                 &AppTaskUsartStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);

    OSTaskCreate(&AppTaskOutputTCB,
                 "Output Task",
                 AppTaskOutput,
                 0,
                 APP_CFG_OUTPUT_TASK_PRIO,
                 &AppTaskOutputStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);

    OSTaskCreate(&AppTaskMonitorTCB,
                 "Monitor Task",
                 AppTaskMonitor,
                 0,
                 APP_CFG_MONITOR_TASK_PRIO,
                 &AppTaskMonitorStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);
}

/* ---------------- GPIO / EXTI ---------------- */
static void AppGpioInit(void)
{
    GPIO_InitTypeDef gpio;

    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA |
                           RCC_AHB1Periph_GPIOB |
                           RCC_AHB1Periph_GPIOC |
                           RCC_AHB1Periph_GPIOD |
                           RCC_AHB1Periph_GPIOF,
                           ENABLE);

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG,
                           ENABLE);

    gpio.GPIO_Mode  = GPIO_Mode_OUT;
    gpio.GPIO_OType = GPIO_OType_PP;
    gpio.GPIO_Speed = GPIO_Speed_2MHz;
    gpio.GPIO_PuPd  = GPIO_PuPd_NOPULL;
    gpio.GPIO_Pin   = LED_ALARM_PIN | LED_POWER_PIN | LED_STATUS_PIN;
    GPIO_Init(LED_GPIO_PORT, &gpio);

